//------------------------------
//დავალება-1:
//------------------------------
console.log("- დავალება 1 -");

for (let i= 0; i<=50; i++ ) {
    console.log(i);
}

//------------------------------
//დავალება-2:
//------------------------------
console.log("- დავალება 2 -");

let a = 0;
while (a<=20) {
    console.log(a);
    a++;
}

//------------------------------
//დავალება-3:
//------------------------------
console.log("- დავალება 3 -");

let b = 0;
do {
    console.log(b)
    b++;
}
while (b<=30);

//------------------------------
//დავალება-4:
//------------------------------
console.log("- დავალება 4 -");